

# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 1.00  # scales module repeats
width_multiple: 1.25  # scales convolution channels

# YOLOv8.0x6 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 9-P6/64
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SimSPPF, [512, 5]]  # 11

# YOLOv8.0x6 head
head:
#  - [-1, 1, Conv, [256, 1, 1]] # 12
  - [8, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, CSPStage, [256]] # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [6, 1, Conv, [256, 3, 2]] # 16
  - [[15, -1], 1, Concat, [1]]
  - [-1, 3, CSPStage, [256]] # 18

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [4, 1, Conv, [256, 3, 2]]
  - [[-1, 6, 19], 1, Concat, [1]]
  - [-1, 3, CSPStage, [256]] # 22

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, CSPStage, [256]] # 25

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 22], 1, Concat, [1]]
  - [-1, 3, CSPStage, [512]] # 28

  - [22, 1, Conv, [256, 3, 2]] # 29
  - [28, 1, Conv, [512, 3, 2]] # 30
  - [[18, 29, -1], 1, Concat, [1]]
  - [-1, 3, CSPStage, [512]] # 32

  - [18, 1, Conv, [256, 3, 2]] # 33
  - [32, 1, Conv, [512, 3, 2]] # 34
  - [[14, 33, -1], 1, Concat, [1]]
  - [-1, 3, CSPStage, [512]] # 36

  - [[25, 28, 32, 36], 1, Detect, [nc]]  # Detect(P3, P4, P5)