# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
#  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
#  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
#  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
#  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, RepNCSPELAN4, [1024, 512, 256, 1]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [128]]  # 18 (P3/8-small)


  - [[9, 12, 15, 18], 1, SimFusion_4in, []] # 19
  - [-1, 1, IFM, [[64, 32]]] # 20

  - [9, 1, Conv, [512, 1, 1]] # 21
  - [[12, 15, -1], 1, SimFusion_3in, [512]] # 22
  - [[-1, 20], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]] # 23
  - [-1, 3, C2f, [512]] # 24

  - [12, 1, Conv, [256, 1, 1]] # 25
  - [[18, 15, -1], 1, SimFusion_3in, [256]] # 26
  - [[-1, 20], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 27
  - [-1, 3, C2f, [256]] # 28

  - [[28, 24, 9], 1, PyramidPoolAgg, [352, 2]] # 29
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 30

  - [[28, 25], 1, AdvPoolFusion, []] # 31
  - [[-1, 30], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 32
  - [-1, 3, C2f, [256]] # 33

  - [[-1, 21], 1, AdvPoolFusion, []] # 34
  - [[-1, 30], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]] # 35
  - [-1, 3, C2f, [1024]] # 36

  - [[12, 15, 18, 28, 33, 36], 1, Detect, [nc]] # 28