# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 5  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.33, 0.25, 1024]
  # s: [0.33, 0.50, 1024]
#  m: [0.67, 0.75, 1024]
  # l: [1.00, 1.00, 1024]
   x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
  ]

# YOLOv5 v6.0 head
head:
  [[8, 1, MSSPPF, [512]],
  [6, 1, MSSPPF, [512]],
  [4, 1, MSSPPF, [512]] ,   # 11


  [[9, 10], 1, ASFF_2, [512, 0]],
  [[9, 10], 1, ASFF_2, [512, 1]],
  [[10, 11], 1, ASFF_2, [512, 0]],
  [[10, 11], 1, ASFF_2, [512, 1]],   # 15

  [12, 3, C3, [512, False]],
  [13, 3, C3, [512, False]],
  [14, 3, C3, [512, False]],
  [15, 3, C3, [512, False]],  # 19

  [[16, 18], 1, ASFF_2, [512, 0]],
  [[17, 19], 1, ASFF_2, [512, 0]],
  [[16, 18], 1, ASFF_2, [512, 1]],
  [[17, 19], 1, ASFF_2, [512, 1]],   # 23

  [20, 3, C3, [512, False]],
  [21, 3, C3, [512, False]],
  [22, 3, C3, [512, False]],
  [23, 3, C3, [512, False]],      # 27



  [[24, 25, 26, 27], 1, Detect, [nc]],  # Detect
]
